import type { LocaleData } from "../../types";

export const date_time: Partial<LocaleData> = {
  AM_PM: {'AM': 'ص', 'PM': 'م'},
  DAY_NAMES: {'0': 'السبت', '1': 'الأحد', '2': 'الإثنين', '3': 'الثلاثاء', '4': 'الأربعاء', '5': 'الخميس', '6': 'الجمعة'},
  MONTH_NAMES: {'01': 'كانون الثّاني', '02': 'شباط', '03': 'آذار', '04': 'نيسان', '05': 'أيّار', '06': 'حزيران', '07': 'تمّوز', '08': 'آب', '09': 'أيلول', '10': 'تشرين الأول', '11': 'تشرين الثاني', '12': 'كانون الأول'},
  centuries: ['الأول', 'الثاني', 'الثالث', 'الرابع', 'الخامس', 'السادس', 'السابع', 'الثامن', 'التاسع', 'العاشر', 'الحادي عشر', 'الثاني عشر', 'الثالث عشر', 'الرابع عشر', 'الخامس عشر', 'السادس عشر', 'الثامن عشر', 'التاسع عشر', 'العشرين', 'الحادي والعشرين', 'الثاني والعشرين'],
};
