import type { LocaleData } from "../../types";

export const color: Partial<LocaleData> = {
  colorNames: {'אדום': '#FF0000', 'אוכרה': '#DDAA33', 'אינדיגו': '#4B0082', 'אפור': '#7F7F7F', 'ארגמן': '#7F003F', 'ורוד': '#FF007F', 'זהב': '#FFDF00', 'חאקי': '#C3B091', 'חום': '#7F3F00', 'טורקיז': '#40E0D0', 'ירוק': '#00FF00', 'כחול': '#0000FF', 'כסף': '#C0C0C0', 'כתום': '#FF7F00', 'לבן': '#FFFFFF', 'מג\'נטה': '#FF00FF', 'סגול': '#7F00FF', 'צהוב': '#FFFF00', 'ציאן': '#00FFFF', 'קרדינל': '#C41E3A', 'שחור': '#000000', 'שני': '#7F0000', 'תכלת': '#007FFF'},
  safeColorNames: ['אדום', 'ירוק', 'כחול', 'צהוב', 'ציאן', 'מג\'נטה', 'לבן'],
};
