import type { LocaleData } from "../../types";

export const person: Partial<LocaleData> = {
  firstNames: ['અંકિતા', 'અવની', 'હીરા', 'કાજલ', 'કિરણ', 'નેહા', 'નિશા', 'પૂજા', 'પ્રાચી', 'પ્રીતિ', 'પ્રીતિ', 'પૂજા', 'રચના', 'રાધીકા', 'શ્રેયા', 'શ્વેતા', 'સોનલ', 'તન્વી', 'તેજલ', 'ઉર્વી', 'વર્ષા', 'અભિષેક', 'અજય', 'અક્ષય', 'આનંદ', 'અનિલ', 'અંકિત', 'અર્જુન', 'અરુણ', 'આશિષ', 'અશોક', 'ભારત', 'બ્રિજેશ', 'ચેતન', 'ચિરાગ', 'દર્શન', 'દીપા', 'દીપક', 'ધવલ', 'દિલીપ', 'દિનેશ', 'દીપા', 'દીપક', 'હરીશ', 'હર્ષ', 'હર્ષલ', 'હીરા', 'જગદીશ', 'જય', 'જયેશ', 'જિતેન્દ્ર', 'કાજલ', 'કમલ', 'કરણ', 'કિરણ', 'કિશન', 'કૃષ્ણ', 'કુમાર', 'કુનાલ', 'મહેન્દ્ર', 'મહેશ', 'મનોજ', 'મયૂર', 'મિતુલ', 'મુકેશ', 'નરેન્દ્ર', 'નીરજ', 'નિખિલ', 'નીરજ', 'નીરવ', 'નિશાંત', 'નિતિન', 'પંકજ', 'પાર્થ', 'પ્રકાશ', 'પ્રણવ', 'પ્રતિક', 'પ્રતિક', 'પ્રવીણ', 'પ્રવીણ', 'રાહુલ', 'રાજ', 'રાજેન્દ્ર', 'રાજેશ', 'રાકેશ', 'રમેશ', 'રવિ', 'રોહિત', 'સચિન', 'સમીર', 'સમીર', 'સંદિપ', 'સંદિપ', 'સંજય', 'સંજીવ', 'સંજીવ', 'શેખર', 'સિદ્ધાર્થ', 'સુભાષ', 'સુનીલ', 'સૂરજ', 'તુષાર', 'વસંત', 'વિક્રમ', 'વિપુલ', 'વિરાજ', 'વિશાલ', 'વિવેક', 'યશ'],
  firstNamesFemale: ['અંકિતા', 'અવની', 'હીરા', 'કાજલ', 'કિરણ', 'નેહા', 'નિશા', 'પૂજા', 'પ્રાચી', 'પ્રીતિ', 'પ્રીતિ', 'પૂજા', 'રચના', 'રાધીકા', 'શ્રેયા', 'શ્વેતા', 'સોનલ', 'તન્વી', 'તેજલ', 'ઉર્વી', 'વર્ષા'],
  firstNamesMale: ['અભિષેક', 'અજય', 'અક્ષય', 'આનંદ', 'અનિલ', 'અંકિત', 'અર્જુન', 'અરુણ', 'આશિષ', 'અશોક', 'ભારત', 'બ્રિજેશ', 'ચેતન', 'ચિરાગ', 'દર્શન', 'દીપા', 'દીપક', 'ધવલ', 'દિલીપ', 'દિનેશ', 'દીપા', 'દીપક', 'હરીશ', 'હર્ષ', 'હર્ષલ', 'હીરા', 'જગદીશ', 'જય', 'જયેશ', 'જિતેન્દ્ર', 'કાજલ', 'કમલ', 'કરણ', 'કિરણ', 'કિશન', 'કૃષ્ણ', 'કુમાર', 'કુનાલ', 'મહેન્દ્ર', 'મહેશ', 'મનોજ', 'મયૂર', 'મિતુલ', 'મુકેશ', 'નરેન્દ્ર', 'નીરજ', 'નિખિલ', 'નીરજ', 'નીરવ', 'નિશાંત', 'નિતિન', 'પંકજ', 'પાર્થ', 'પ્રકાશ', 'પ્રણવ', 'પ્રતિક', 'પ્રતિક', 'પ્રવીણ', 'પ્રવીણ', 'રાહુલ', 'રાજ', 'રાજેન્દ્ર', 'રાજેશ', 'રાકેશ', 'રમેશ', 'રવિ', 'રોહિત', 'સચિન', 'સમીર', 'સમીર', 'સંદિપ', 'સંદિપ', 'સંજય', 'સંજીવ', 'સંજીવ', 'શેખર', 'સિદ્ધાર્થ', 'સુભાષ', 'સુનીલ', 'સૂરજ', 'તુષાર', 'વસંત', 'વિક્રમ', 'વિપુલ', 'વિરાજ', 'વિશાલ', 'વિવેક', 'યશ'],
  formatsFemale: ['{{first_name_female}} {{last_name}}', '{{prefix_female}} {{first_name_female}} {{last_name}}'],
  formatsMale: ['{{first_name_male}} {{last_name}}', '{{prefix_male}} {{first_name_male}} {{last_name}}'],
  lastNames: ['ચૌધરી', 'ચૌધરી', 'ગઢવી', 'ગુપ્તા', 'જૈન', 'જોષી', 'કુમાર', 'પટેલ', 'શર્મા'],
  nameFormats: ['{{first_name}} {{last_name}}', '{{prefix}} {{first_name}} {{last_name}}'],
  prefixes: ['શ્રીમતી', 'કુમારી', 'શ્રી', 'શ્રી માન'],
  prefixesFemale: ['શ્રીમતી', 'કુમારી'],
  prefixesMale: ['શ્રી', 'શ્રી માન'],
};
